# parameters

nc: 1  # number of classes

depth_multiple: 1.0  # model depth multiple

width_multiple: 1.0  # layer channel multiple

# hyperparameters
lr0: 0.01  # initial learning rate (SGD=1E-2, Adam=1E-3) 
lrf: 0.01  # final OneCycleLR learning rate (lr0 * lrf) 
momentum: 0.937  # SGD momentum/Adam beta1 
weight_decay: 0.0005  # optimizer weight decay 5e-4 
warmup_epochs: 3.0  # warmup epochs (fractions ok) 
warmup_momentum: 0.8  # warmup initial momentum 
warmup_bias_lr: 0.1  # warmup initial bias lr 
box: 0.05  # box loss gain 
cls: 0.5  # cls loss gain 
cls_pw: 1.0  # cls BCELoss positive_weight 
obj: 1.0  # obj loss gain (scale with pixels) 
obj_pw: 1.0  # obj BCELoss positive_weight 
iou_t: 0.20  # IoU training threshold 
anchor_t: 4.0  # anchor-multiple threshold 
# anchors: 3  # anchors per output layer (0 to ignore) 
fl_gamma: 0.0  # focal loss gamma (efficientDet default gamma=1.5) 
hsv_h: 0.015  # image HSV-Hue augmentation (fraction) 
hsv_s: 0.7  # image HSV-Saturation augmentation (fraction) 
hsv_v: 0.4  # image HSV-Value augmentation (fraction) 
degrees: 0.0  # image rotation (+/- deg) 
translate: 0.1  # image translation (+/- fraction) 
scale: 0.5  # image scale (+/- gain) 
shear: 0.0  # image shear (+/- deg) 
perspective: 0.0  # image perspective (+/- fraction), range 0-0.001 
flipud: 0.0  # image flip up-down (probability) 
fliplr: 0.5  # image flip left-right (probability) 
mosaic: 1.0  # image mosaic (probability) 
mixup: 0.0  # image mixup (probability) 
copy_paste: 0.0  # segment copy-paste (probability) 


# anchors

anchors:

  - [10,13, 16,30, 33,23]  # P3/8

  - [30,61, 62,45, 59,119]  # P4/16

  - [116,90, 156,198, 373,326]  # P5/32



# yolov7-tiny backbone

backbone:

  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True

  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  

  

   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4    

   

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 7

   

   [-1, 1, MP, []],  # 8-P3/8

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 14

   

   [-1, 1, MP, []],  # 15-P4/16

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 21

   

   [-1, 1, MP, []],  # 22-P5/32

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 28

  ]



# yolov7-tiny head

head:

  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, SP, [5]],

   [-2, 1, SP, [9]],

   [-3, 1, SP, [13]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -7], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 37

  

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],

   [21, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4

   [[-1, -2], 1, Concat, [1]],

   

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 47

  

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],

   [14, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3

   [[-1, -2], 1, Concat, [1]],

   

   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 57

   

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, 47], 1, Concat, [1]],

   

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[-1, -2, -3, -4], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 65)
